In [2]:
import pandas as pd

# Creating a sample DataFrame
data = {
    "ID": [1, 2, 3, 4],
    "Name": ["John", "Alice", "Bob", "Eve"],
    "Age": [28, 24, 35, 42],
    "Score": [85, 90, 78, 88],
}

df = pd.DataFrame(data)

print(df)

   ID   Name  Age  Score
0   1   John   28     85
1   2  Alice   24     90
2   3    Bob   35     78
3   4    Eve   42     88

In [3]:
list(df.items())

[('ID',
  0    1
  1    2
  2    3
  3    4
  Name: ID, dtype: int64),
 ('Name',
  0     John
  1    Alice
  2      Bob
  3      Eve
  Name: Name, dtype: object),
 ('Age',
  0    28
  1    24
  2    35
  3    42
  Name: Age, dtype: int64),
 ('Score',
  0    85
  1    90
  2    78
  3    88
  Name: Score, dtype: int64)]

In [4]:
for key, value in df.items():
  print(f"{key}, {value[0]}")

ID, 1
Name, John
Age, 28
Score, 85

In [5]:
for key, val in df.iterrows():
  print(key, val)

0 ID          1
Name     John
Age        28
Score      85
Name: 0, dtype: object
1 ID           2
Name     Alice
Age         24
Score       90
Name: 1, dtype: object
2 ID         3
Name     Bob
Age       35
Score     78
Name: 2, dtype: object
3 ID         4
Name     Eve
Age       42
Score     88
Name: 3, dtype: object

In [6]:
df.itertuples()

In [7]:
list(df.itertuples())[0]

Pandas(Index=0, ID=1, Name='John', Age=28, Score=85)

In [8]:
for key, val in df.items():
  print(key, val[0])

ID 1
Name John
Age 28
Score 85

In [9]:
for key, val in df.iterrows():
  print(key, val)

0 ID          1
Name     John
Age        28
Score      85
Name: 0, dtype: object
1 ID           2
Name     Alice
Age         24
Score       90
Name: 1, dtype: object
2 ID         3
Name     Bob
Age       35
Score     78
Name: 2, dtype: object
3 ID         4
Name     Eve
Age       42
Score     88
Name: 3, dtype: object

In [10]:
list(df.iterrows())

[(0,
  ID          1
  Name     John
  Age        28
  Score      85
  Name: 0, dtype: object),
 (1,
  ID           2
  Name     Alice
  Age         24
  Score       90
  Name: 1, dtype: object),
 (2,
  ID         3
  Name     Bob
  Age       35
  Score     78
  Name: 2, dtype: object),
 (3,
  ID         4
  Name     Eve
  Age       42
  Score     88
  Name: 3, dtype: object)]

In [11]:
ser = pd.Series(data=[1, 3, 54, 7], index=list('abcd'))

In [12]:
ser[0]

C:\Users\Aayush\AppData\Local\Temp\ipykernel_1872\2519058933.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0]

1

In [13]:
ser

a     1
b     3
c    54
d     7
dtype: int64

In [14]:
ser['a']

1

In [15]:
ser[3]

C:\Users\Aayush\AppData\Local\Temp\ipykernel_1872\939278866.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[3]

7

In [16]:
import pandas as pd

# Creating the DataFrame
data = {
    "Name": ["Arpit", "Manish", "Joy", "Rohit", "Virat", "Shreya"],
    "Age": [30, 35, 37, 33, 34, 30],
    "Salary": [100000, 93000, 88000, 120000, 94000, 95000],
    "Designation": ["Engineer", "Artist", "Painter", "Singer", "Designer", "Dancer"],
}

df = pd.DataFrame(data)

print(df)

     Name  Age  Salary Designation
0   Arpit   30  100000    Engineer
1  Manish   35   93000      Artist
2     Joy   37   88000     Painter
3   Rohit   33  120000      Singer
4   Virat   34   94000    Designer
5  Shreya   30   95000      Dancer

- Q) Select name and age of those employees whose salary is less than mean salary

In [17]:
import numpy as np
print(np.mean(df['Salary']))
df.loc[df.Salary< df['Salary'].mean(), ['Name', 'Age']]

98333.33333333333

     Name  Age
1  Manish   35
2     Joy   37
4   Virat   34
5  Shreya   30

In [18]:
df.loc[df['Salary']<np.mean(df['Salary'])][['Name', 'Age']]

     Name  Age
1  Manish   35
2     Joy   37
4   Virat   34
5  Shreya   30

In [19]:
df.loc[df['Salary']<np.mean(df['Salary'])].loc[:, 'Name': 'Age']

     Name  Age
1  Manish   35
2     Joy   37
4   Virat   34
5  Shreya   30

- Q) Name and age of employees with salary less than 1 lakh and age less than 40.

In [20]:
df.loc[(df['Salary']<100000) & (df['Age']<40), ['Name', 'Age']]

     Name  Age
1  Manish   35
2     Joy   37
4   Virat   34
5  Shreya   30

In [21]:
df.loc[(df['Salary']<100000) & (df['Age']<40)].loc[:, ['Name', 'Salary']]

     Name  Salary
1  Manish   93000
2     Joy   88000
4   Virat   94000
5  Shreya   95000

- Q) Add a new col salary_after5 which is 1.5 times original salary

In [22]:
df.assign(salaray_after5=lambda x: x['Salary'] * 1.5)

     Name  Age  Salary Designation  salaray_after5
0   Arpit   30  100000    Engineer        150000.0
1  Manish   35   93000      Artist        139500.0
2     Joy   37   88000     Painter        132000.0
3   Rohit   33  120000      Singer        180000.0
4   Virat   34   94000    Designer        141000.0
5  Shreya   30   95000      Dancer        142500.0

In [23]:
df['salary_after5'] = df.apply(lambda x: x['Salary'] * 1.5, axis=1)

In [24]:
df

     Name  Age  Salary Designation  salary_after5
0   Arpit   30  100000    Engineer       150000.0
1  Manish   35   93000      Artist       139500.0
2     Joy   37   88000     Painter       132000.0
3   Rohit   33  120000      Singer       180000.0
4   Virat   34   94000    Designer       141000.0
5  Shreya   30   95000      Dancer       142500.0

In [25]:
# df['Salary_after5'] = df['Salary'] * 1.5

In [26]:
df.describe(percentiles=[0.6, 0.95]).loc[['60%', '95%'],'Salary']

60%     95000.0
95%    115000.0
Name: Salary, dtype: float64

In [27]:
df.describe(percentiles=[0.6, 0.95]).T.loc['Salary', ['60%', '95%']]

60%     95000.0
95%    115000.0
Name: Salary, dtype: float64

- display top 2 salaries

In [28]:
df.sort_values(by="Salary", ascending=False).reset_index(drop=True).loc[:1, ['Salary', 'Name']]

   Salary   Name
0  120000  Rohit
1  100000  Arpit

- Q6) Replace the salary to mean if value less than 100000 where designation is Engineer

In [29]:
df

     Name  Age  Salary Designation  salary_after5
0   Arpit   30  100000    Engineer       150000.0
1  Manish   35   93000      Artist       139500.0
2     Joy   37   88000     Painter       132000.0
3   Rohit   33  120000      Singer       180000.0
4   Virat   34   94000    Designer       141000.0
5  Shreya   30   95000      Dancer       142500.0

In [30]:
df.drop(columns='salary_after5', inplace=True)

In [31]:
ser.mean()

16.25

In [32]:
def alt_sal(col):
  if col.name == 'Salary':
    return col.apply(lambda x: round(col.mean(), 2) if x < col.mean() and  else x)
  return col

SyntaxError: expected 'else' after 'if' expression (329732543.py, line 3)

In [33]:
def alt_row(row):
  if row['Salary'] < np.mean(df['Salary']) and row['Designation'] == 'Engineer':
    return np.mean(df['Salary'])
  return row['Salary']

In [34]:
df.apply(alt_row, axis=1)

0    100000
1     93000
2     88000
3    120000
4     94000
5     95000
dtype: int64

In [35]:
df.apply(lambda col: alt_sal(col) )

NameError: name 'alt_sal' is not defined

In [36]:
df[['Name']]

     Name
0   Arpit
1  Manish
2     Joy
3   Rohit
4   Virat
5  Shreya

In [37]:
df[['Name', 'Designation']] = df.apply(lambda x: x[['Name', 'Designation']].str.lower(), axis=1)

In [38]:
 df.apply(lambda x: x[['Name', 'Designation']].str.lower(), axis=1)

     Name Designation
0   arpit    engineer
1  manish      artist
2     joy     painter
3   rohit      singer
4   virat    designer
5  shreya      dancer

In [39]:
df.apply(lambda x: x[['Name']].str.upper(), axis=1)

     Name
0   ARPIT
1  MANISH
2     JOY
3   ROHIT
4   VIRAT
5  SHREYA

In [40]:
df.loc[0, :]['Name']

'arpit'

In [41]:
df

     Name  Age  Salary Designation
0   arpit   30  100000    engineer
1  manish   35   93000      artist
2     joy   37   88000     painter
3   rohit   33  120000      singer
4   virat   34   94000    designer
5  shreya   30   95000      dancer

Display the mean age of people who are not engineers

In [53]:
df.loc[(df['Designation'].str.title() != 'Engineer'), :]

     Name  Age  Salary Designation
1  manish   35   93000      artist
2     joy   37   88000     painter
3   rohit   33  120000      singer
4   virat   34   94000    designer
5  shreya   30   95000      dancer

In [50]:
df.loc[(df['Designation'] != 'Engineer'), 'Age'].mean()

33.166666666666664

In [57]:
df['pay'] = df.apply(lambda x: 'high' if x['Salary'] > 100000 else 'low', axis=1)

In [58]:
df

     Name  Age  Salary Designation   pay
0   arpit   30  100000    engineer   low
1  manish   35   93000      artist   low
2     joy   37   88000     painter   low
3   rohit   33  120000      singer  high
4   virat   34   94000    designer   low
5  shreya   30   95000      dancer   low

In [62]:
df.loc[df['pay'] == 'high', 'Salary'].mean()

120000.0

In [63]:
df.loc[df['pay'] == 'low', 'Salary'].mean()

94000.0

In [64]:
df.loc[df['pay'] == 'high', 'Salary'].mean() - df.loc[df['pay'] == 'low', 'Salary'].mean()

26000.0